{
  "auto_mapping": null,
  "base_model_name_or_path": "t5-small",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 8,
  "num_layers": 6,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 8,
  "peft_type": "PROMPT_TUNING",
  "peft_version": "0.19.1",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify this text:",
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 512,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "t5-small"
}